In [ ]:
#In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

# 1. Establish a connection between Python and the Sakila database.

In [244]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [245]:
password = getpass()

········

In [246]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [247]:
type(engine)

sqlalchemy.engine.base.Engine

In [248]:
data = pd.read_sql_query("SELECT *, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') AS month, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') AS year FROM sakila.rental", engine)
#data.head()

In [249]:
data = pd.read_sql_query("SELECT *, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') AS month, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') AS year FROM sakila.rental", engine)
#data.head() 

data[(data['month'] == '05') & (data['year'] == '2005') ]

data.drop(columns = ['month','year'], inplace = True)

# 1 Python function rentals_month

In [252]:
# Working with SQL

def rentals_monthsql(eng, month, year):

    query = "SELECT * FROM rental WHERE DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') = "+month+" AND DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') = "+year+""
    
    df = pd.read_sql_query(query, eng)
    
    df = df.reset_index(drop = True)
    
    return df

In [253]:
#Working with Python

def rentals_monthpy(engine, month, year):

    query = "SELECT *, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') AS month, DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') AS year FROM sakila.rental"
    
    df = pd.read_sql_query(query, engine)
    
    df = df[(df['month'] == month) & (df['year'] == year) ]

    df.drop(columns = ['month','year'], inplace = True)
    
    df = df.reset_index(drop = True)
    
    return df

In [254]:
new_df = rentals_monthpy(engine, '07', '2005')

In [255]:
new_df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,3470,2005-07-05 22:49:24,883,565,2005-07-07 19:36:24,1,2006-02-15 21:30:53
1,3471,2005-07-05 22:51:44,1724,242,2005-07-13 01:38:44,2,2006-02-15 21:30:53
2,3472,2005-07-05 22:56:33,841,37,2005-07-13 17:18:33,2,2006-02-15 21:30:53
3,3473,2005-07-05 22:57:34,2735,60,2005-07-12 23:53:34,1,2006-02-15 21:30:53
4,3474,2005-07-05 22:59:53,97,594,2005-07-08 20:32:53,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
6704,10176,2005-07-31 23:40:35,1181,19,2005-08-09 00:46:35,2,2006-02-15 21:30:53
6705,10177,2005-07-31 23:42:33,2242,279,2005-08-03 01:30:33,2,2006-02-15 21:30:53
6706,10178,2005-07-31 23:43:04,1582,491,2005-08-03 00:43:04,1,2006-02-15 21:30:53
6707,10179,2005-07-31 23:49:54,2136,131,2005-08-01 20:46:54,2,2006-02-15 21:30:53
6708,10180,2005-07-31 23:57:43,757,50,2005-08-09 04:04:43,2,2006-02-15 21:30:53

# 2 Python function rental_count_month

In [256]:
def rental_count_month(df):
    
    
    test_df = df.groupby('customer_id')[['rental_id']].count()
    
    
    df['rental_date'] = df['rental_date'].astype(str)
    test_df.rename(columns = {'rental_id':"rental_"+df['rental_date'].str.split('-')[0][1]+"_"+df['rental_date'].str.split('-')[0][0]}, inplace = True)

    return test_df

In [257]:
july_count = rental_count_month(new_df)

# 3 Python function compare_rentals

In [258]:
august_count

             rental_08_2005
customer_id
1                        11
2                        11
3                         7
4                        11
5                        13
...                     ...
595                       8
596                      13
597                      12
598                       5
599                       7

[599 rows x 1 columns]

In [259]:
july_count

             rental_07_2005
customer_id
1                        12
2                        14
3                        13
4                         5
5                        16
...                     ...
595                      19
596                       6
597                       7
598                      16
599                       7

[599 rows x 1 columns]

In [260]:
august_count.join(july_count)

             rental_08_2005  rental_07_2005
customer_id
1                        11              12
2                        11              14
3                         7              13
4                        11               5
5                        13              16
...                     ...             ...
595                       8              19
596                      13               6
597                      12               7
598                       5              16
599                       7               7

[599 rows x 2 columns]

In [261]:
def compare_rentals(df1, df2):

    difference = df1.join(df2)
    
    
    list_difference = []
    
    for i in range(len(difference)):
        if difference.iloc[:,1][i+1] > difference.iloc[:,0][i+1]:
            list_difference.append(difference.iloc[:,1][i+1] - difference.iloc[:,0][i+1])
        elif difference.iloc[:,0][i+1] > difference.iloc[:,1][i+1]:
            list_difference.append(difference.iloc[:,0][i+1] - difference.iloc[:,1][i+1])
        else: list_difference.append(0)
           
    difference['difference'] = list_difference   
    
    return difference

In [282]:
for i in difference.index:
    print(i)

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143
144
145
146
147
148
149
150
151
152
153
154
155
156
157
158
159
160
161
162
163
164
165
166
167
168
169
170
171
172
173
174
175
176
177
178
179
180
181
182
183
184
185
186
187
188
189
190
191
192
193
194
195
196
197
198
199
200
201
202
203
204
205
206
207
208
209
210
211
212
213
214
215
216
217
218
219
220
221
222
223
224
225
226
227
228
229
230
231
232
233
234
235
236
237
238
239
240
241
242
243
244
245
246
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
262
263
264
265
266
267
268
269
270
271
272
273
274
275
276
277
278
279
280
281
282
283
284
285
286
287
288
289
290
291
292
293
294
295
296
297
298
299
300
301
302
303
304
305
306
307
308
309
310
311
312
313
314
315
316
317
318
319
320
321
322
323
324
325
326
327
328
329
330
331
332
333
334
335
336
337
338
339
340
341
342
343
344
345
346
347
348
349
350
351
352
353
354
355
356
357
358
359
360
361
362
363
364
365
366
367
368
369
370
371
372
373
374
375
376
377
378
379
380
381
382
383
384
385
386
387
388
389
390
391
392
393
394
395
396
397
398
399
400
401
402
403
404
405
406
407
408
409
410
411
412
413
414
415
416
417
418
419
420
421
422
423
424
425
426
427
428
429
430
431
432
433
434
435
436
437
438
439
440
441
442
443
444
445
446
447
448
449
450
451
452
453
454
455
456
457
458
459
460
461
462
463
464
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
480
481
482
483
484
485
486
487
488
489
490
491
492
493
494
495
496
497
498
499
500
501
502
503
504
505
506
507
508
509
510
511
512
513
514
515
516
517
518
519
520
521
522
523
524
525
526
527
528
529
530
531
532
533
534
535
536
537
538
539
540
541
542
543
544
545
546
547
548
549
550
551
552
553
554
555
556
557
558
559
560
561
562
563
564
565
566
567
568
569
570
571
572
573
574
575
576
577
578
579
580
581
582
583
584
585
586
587
588
589
590
591
592
593
594
595
596
597
598
599

In [277]:
compare_rentals

# Function with all the functions

In [283]:
def super_func(eng, month_1, year_1, month_2, year_2):

    
    def rentals_monthsql(eng, month, year):
    
        query = "SELECT * FROM rental WHERE DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%m') = "+month+" AND DATE_FORMAT(CONVERT(LEFT(rental_date,10),date),'%%Y') = "+year+""
        
        df = pd.read_sql_query(query, eng)
        
        df.reset_index(drop = True)
        
        return df
    
    
    
    def rental_count_month(df):
    
    
        test_df = df.groupby('customer_id')[['rental_id']].count()
        
        
        df['rental_date'] = df['rental_date'].astype(str)
        test_df.rename(columns = {'rental_id':"rental_"+df['rental_date'].str.split('-')[0][1]+"_"+df['rental_date'].str.split('-')[0][0]}, inplace = True)
        return test_df
     
    
    
    def compare_rentals(df1, df2):

        difference = df1.join(df2, how='inner')
        
        
        list_difference = []
        
        for i in difference.index:
            if difference.iloc[:,1][i] > difference.iloc[:,0][i]:
                list_difference.append(difference.iloc[:,1][i] - difference.iloc[:,0][i])
            elif difference.iloc[:,0][i] > difference.iloc[:,1][i]:
                list_difference.append(difference.iloc[:,0][i] - difference.iloc[:,1][i])
            else: list_difference.append(0)
               
        difference['difference'] = list_difference   
        
        return difference
    
    
    monthly_rental_1 = rentals_monthsql(engine, month_1, year_1)
    monthly_rental_2 = rentals_monthsql(engine, month_2, year_2)
    
    
    count_rent_1 = rental_count_month(monthly_rental_1)
    count_rent_2 = rental_count_month(monthly_rental_2)
    
    
    rental_comparisons = compare_rentals(count_rent_1, count_rent_2)
    
    return monthly_rental_1, monthly_rental_2, count_rent_1, count_rent_2, rental_comparisons

In [292]:
a,b,c,d,e = super_func(engine, '06', '2005', '08', '2005')

In [293]:
e

             rental_06_2005  rental_08_2005  difference
customer_id
1                         7              11           4
2                         1              11          10
3                         4               7           3
4                         6              11           5
5                         5              13           8
...                     ...             ...         ...
595                       2               8           6
596                       2              13          11
597                       3              12           9
598                       1               5           4
599                       4               7           3

[590 rows x 3 columns]